Revit 2027 API
PlanCircuit.IsRoomLocated Property
Reports whether there is a room located in this circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRoomLocated { get; }
Public ReadOnly Property IsRoomLocated As Boolean
	Get
public:
property bool IsRoomLocated {
	bool get ();
}
member IsRoomLocated : bool with get
Property Value
Boolean
True if there is a room located in this circuit on the circuit's level, false if there is no room located in this circuit on the circuit's level.
See Also
Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace